Repository: lwchkg/pentobi
Catalog: pentobi_thumbnailer/po/*.po
Languages: de

# _
source: translator-credits
de: Markus Enzenberger <enz@users.sourceforge.net>, 2019

source: Pentobi Command Reference
de: Pentobi Befehlsreferenz

source: thumbnailer for game records for the board game Blokus as used by the program Pentobi
de: Vorschaubildgenerator für Spieldateien des Brettspiels Blokus, wie vom Programm Pentobi verwendet

source: <_:command-1/> <arg> <group choice="plain"> <arg choice="plain"><_:option-2/></arg> <arg choice="plain"><_:option-3/></arg> </group> <replaceable>n</replaceable> </arg> <arg choice="plain"><replaceable>inputfile</replaceable></arg> <arg choice="plain"><replaceable>outputfile</replaceable></arg>
de: <_:command-1/> <arg> <group choice="plain"> <arg choice="plain"><_:option-2/></arg> <arg choice="plain"><_:option-3/></arg> </group> <replaceable>n</replaceable> </arg> <arg choice="plain"><replaceable>Eingabedatei</replaceable></arg> <arg choice="plain"><replaceable>Ausgabedatei</replaceable></arg>

source: Description
de: Beschreibung

source: <_:command-1/> is part of the program Pentobi and intended to be used as a thumbnailer for the Gnome desktop environment to generate previews of game files written by Pentobi.
de: <_:command-1/> ist ein Teil des Programms Pentobi und dafür gedacht, Vorschaubilder für die Desktopumgebung Gnome zu Spieldateien zu generieren, die von Pentobi gespeichert werden.

source: The input file is a game file in Pentobi's SGF format as documented in Pentobi-SGF.md in the Pentobi source package. The output file is a thumbnail image in PNG format.
de: Die Eingabedatei ist in Pentobis SGF-Format, wie in Pentobi-SGF.md im Quelltextpaket von Pentobi dokumentiert. Die Ausgabedatei ist ein Vorschaubild im PNG-Format.

source: Options
de: Optionen

source: Display help and exit.
de: Hilfe anzeigen und Programm beenden.

source: The size of the thumbnail. The default is 128.
de: Die Größe des Vorschaubildes. Voreingestellt ist 128.

source: Display version and exit.
de: Version anzeigen und Programm beenden.

source: Exit Status
de: Rückgabewert

source: 0 if the thumbnail generation succeeds, 1 on error.
de: 0, wenn die Generierung des Vorschaubildes erfolgreich ist, 1 im Fehlerfall.

source: See Also
de: Siehe auch
