Repository: lwchkg/pentobi
Catalog: pentobi/unix/po/*.po
Languages: es, ru

# _
source: translator-credits
es: traductor-créditos
ru: переводчик-вклад

source: Pentobi Command Reference
es: Referencia de comandos de Pentobi
ru: Справочник команд Pentobi

source: computer opponent for the board game Blokus
es: rival virtual para el juego de mesa Blokus
ru: конкурент компьютерной настольной игры Блокус

source: <_:command-1/> <arg><_:option-2/> <replaceable>n</replaceable></arg> <arg><_:option-3/></arg> <arg><_:option-4/></arg> <arg><_:option-5/></arg> <arg><_:option-6/> <replaceable>n</replaceable></arg> <arg><_:option-7/> <replaceable>n</replaceable></arg> <arg><_:option-8/></arg> <arg><replaceable>file.blksgf</replaceable></arg>
ru: <_:command-1/> <arg><_:option-2/> <replaceable>n</replaceable></arg> <arg><_:option-3/></arg> <arg><_:option-4/></arg> <arg><_:option-5/></arg> <arg><_:option-6/> <replaceable>n</replaceable></arg> <arg><_:option-7/> <replaceable>n</replaceable></arg> <arg><_:option-8/></arg> <arg><replaceable>файл.blksgf</replaceable></arg>

source: Description
es: Descripción
ru: Описание

source: <_:command-1/> is the command to invoke the program Pentobi, which is a graphical user interface and computer opponent for the board game Blokus.
es: <_:command-1/> es el comando para invocar el programa Pentobi, que es una interfaz gráfica de usuario y un rival virtual para el juego de mesa Blokus.
ru: <_:command-1/> это команда для вызова программы Pentobi, которая представляет собой графический интерфейс пользователя и компьютерный оппонент для настольной игры Блокус.

source: The command can take the name of a game file to open at startup as an optional argument. The game file is expected to be in Pentobi's SGF format as documented in Pentobi-SGF.md in the Pentobi source package.
es: El comando puede seleccionar el nombre de un archivo de partida para abrir al inicio como un argumento opcional. Es necesario que el archivo de partida esté en formato SGF de Pentobi tal y como se explica en Pentobi-SGF.md dentro del paquete de origen de Pentobi.
ru: В качестве необязательного аргумента команда может принимать имя файла игры, открываемого при запуске. Ожидается, что файл игры будет в формате SGF Pentobi, как описано в Pentobi-SGF.md в исходном пакете Pentobi.

source: Options
es: Opciones
ru: Параметры

source: Display help and exit.
es: Mostrar ayuda y salir.
ru: Показать справку и выйти.

source: Set the maximum playing level. Reducing this value reduces the amount of memory used by the search, which can be useful to run Pentobi on systems that have low memory or are too slow to use the highest levels. By default, Pentobi currently allocates up to 2 GB (but not more than a quarter of the physical memory available on the system). Reducing the maximum level to 8 currently reduces this amount by a factor of 3 to 4 and lower maximum levels even more.
es: Seleccione el nivel máximo de juego. Si reduce este valor se reduce también la cantidad de memoria utilizada para realizar la búsqueda, lo que puede resultar útil para jugar a Pentobi en sistemas que tengan poca memoria o que sean demasiado lentos cuando se seleccionan los niveles más altos. Por defecto, Pentobi actualmente asigna hasta un máximo de 2 GB (pero nunca más de un cuarto de la memoria física disponible en el sistema). Actualmente, al reducir el nivel máximo a 8 contribuye a reducir esta cantidad por un factor de 3 a 4 y a reducir los niveles máximos aún más.
ru: Установите максимальный уровень игры. Уменьшение этого значения уменьшает объем памяти, используемый поиском, что может быть полезно для запуска Pentobi в системах с низким объемом памяти или слишком медленными для использования самых высоких уровней. По умолчанию Pentobi в настоящее время выделяет до 2 ГБ (но не более четверти физической памяти, доступной в системе). Снижение максимального уровня до 8 в настоящее время уменьшает это количество в 3–4 раза и еще больше снижает максимальные уровни.

source: Use a window layout optimized for smartphones and apply some user interface changes that assume that a touchscreen is the main input device. If this option is not used, the default layout depends on the platform. Using this option also changes the default style for GUI elements of QQuickControls 2 to Default if the style is not explicitly set with option <_:option-1/>.
es: Utiliza una configuración de ventana optimizada para móviles y aplica algunos cambios a la interfaz de usuario que implican que la pantalla táctil es el dispositivo principal de entrada. Si no se utiliza esta opción, la configuración por defecto depende de la plataforma. Utilizar esta opción también supone cambiar el estilo por defecto de los elementos GUI de QQuickControls 2 a los que vienen por defecto si el estilo no está explícitamente determinado con la opción <_:option-1/>.
ru: Используйте макет окна, оптимизированный для смартфонов, и внесите некоторые изменения в пользовательский интерфейс, предполагающие, что сенсорный экран является основным устройством ввода. Если этот параметр не используется, макет по умолчанию зависит от платформы. Использование этой опции также изменяет стиль по умолчанию для элементов графического интерфейса QQuickControls 2 на Дефолтный, если стиль не задан явно с помощью опции <_:option-1/>.

source: Do not use opening books.
es: No utilizar abrir libros.
ru: Не использовать открытие книг.

source: Do not delay fast computer moves. By default, the computer player adds a small delay if the move generation took less than a second to make it easier for the human to follow the game if the computer plays several moves in a row.
es: No ralentice los movimientos rápidos de la máquina. Por defecto, el jugador de la máquina añade un pequeño retraso si la generación del movimiento tarda menos de un segundo para así hacer más fácil al contrincante humano poder seguir la partida si la máquina realiza varios movimientos seguidos.
ru: Не снижайте быстрые ходы компьютера. По умолчанию компьютерный игрок добавляет небольшую задержку, если генерация хода заняла менее секунды, чтобы человеку было легче следить за игрой, если компьютер выполняет несколько ходов подряд.

source: Set the seed for the random generator. Using a fixed seed makes the move generation deterministic if no multi-threading is used (see option <_:option-1/>).
es: Seleccione el valor de inicialización para el generador aleatorio. Si usa un valor de inicialización fijo la generación de movimientos será determinista si no se utilizan subprocesos múltiples (consulte la opción <_:option-1/>).
ru: Задайте начальное число для генератора случайных чисел. Использование фиксированного начального числа делает генерацию перемещения детерминированной, если не используется многопоточность (см. Параметр <_:option-1/>).

source: The number of threads to use in the search. By default, up to 8 threads are used in the search depending on the number of hardware threads supported by the current system. Using more threads will speed up the move generation but using a very high number of threads (e.g. more than 8) can degrade the playing strength in higher playing levels.
es: El número de subprocesos que se pueden utilizar en la búsqueda. Por defecto, se utilizan hasta un máximo de 8 subprocesos en la búsqueda dependiendo del número de subprocesos de hardware admitidos por el sistema actual. Usar más subprocesos supone acelerar la generación de movimientos aunque si se usan demasiados subprocesos (p. ej., más de 8) se puede reducir la habilidad del juego en los niveles de juego más altos.
ru: Количество потоков, используемых при поиске. По умолчанию при поиске используется до 8 потоков в зависимости от количества аппаратных потоков, поддерживаемых текущей системой. Использование большего количества потоков ускорит создание ходов, но использование очень большого количества потоков (например, более 8) может снизить эффективность игры на более высоких уровнях игры.

source: Print internal information about the move generation and other debugging information to standard error.
es: Imprimir documentación interna relacionada con la generación de movimientos y otra información de depuración de errores típicos.
ru: Вывести внутреннюю информацию о генерации хода и другую отладочную информацию в стандартную ошибку.

source: Standard Qt Options
es: Opciones habituales de Qt
ru: Стандартные параметры Qt

source: Additionally, any options supported by Qt applications can be used, such as:
es: Además, se puede usar cualquier opción compatible con las aplicaciones Qt, como:
ru: Кроме того, можно использовать любые опции, поддерживаемые приложениями Qt, такие как:

source: Switches displays on X11.
es: Los cambios se muestran en X11.
ru: Переключает дисплеи на X11.

source: Window geometry using the X11 syntax.
es: Geometría de ventana utilizando la sintaxis de X11.
ru: Геометрия окна использует синтаксис X11.

source: Set the style for the GUI elements of QQuickControls.
es: Seleccione el estilo de los elementos GUI de QQuickControls.
ru: Установить стиль для элементов графического интерфейса QQuickControls.

source: Display version and exit.
es: Mostrar versión y salir.
ru: Показать версию и выйти.

source: See Also
es: Consulte también
ru: Смотрите также

source: Computer opponent for the board game Blokus
es: Rival virtual para el juego de mesa Blokus
ru: Конкурент компьютерной настольной игры Блокус

source: Pentobi is a computer opponent for the board game Blokus. It has a strong Blokus engine with different playing levels. The supported game variants are Classic, Duo, Trigon, Junior, Nexos, Callisto and GembloQ.
es: Pentobi es un rival virtual para el juego de mesa Blokus. Cuenta con un potente motor para Blokus con diferentes niveles de juego. Las variantes de juego compatibles son Clásico, Dúo, Trigón, Sencillo, Nexos, Calisto y GembloQ.
ru: Pentobi оппонент компьютерной настольной игры Блокус. Он имеет сильный движок Блокус с различными уровнями игры. Поддерживаемые варианты игры-Классический, Двое, Тригон, Юниор, Нексос, Каллисто и ГемблоQ.

source: Players can determine their strength by playing rated games against the computer and use a game analysis function. Games can be saved in Smart Game Format with comments and move variations.
es: Los jugadores pueden conocer su habilidad participando en partidas con selección de nivel contra la máquina y usar una función de análisis de la partida. Las partidas se pueden guardar en formato Smart Game Format con comentarios y variaciones de movimientos.
ru: Игроки могут определить свою силу, играя в рейтинговые игры против компьютера и используя функцию анализа игры. Игры могут быть сохранены в формате Smart Game с комментариями и вариациями ходов.

source: System requirements: 1 GB RAM, 1 GHz CPU (4 GB RAM, 2.5 GHz dual-core or faster CPU recommended for playing level 9).
es: Requisitos de sistema: 1 GB RAM, 1 GHz CPU (4 GB RAM, 2,5 GHz dual-core o CPU más rápida recomendada para jugar en el nivel 9).
ru: Системные требования: 1 GB RAM, 1 GHz CPU (4 GB RAM, 2.5 GHz dual-core или больше CPU рекомендуется для игрового уровня 9).

source: Trademark disclaimer: The trademark Blokus and other trademarks referred to are property of their respective trademark holders. The trademark holders are not affiliated with the author of the program Pentobi.
es: Exención de responsabilidad de la marca comercial: la marca comercial Blokus y otras marcas comerciales mencionadas son propiedad de sus respectivos propietarios. Los propietarios de las marcas comerciales no están afiliados con el autor del programa Pentobi.
ru: Отказ от ответственности за товарный знак: товарный знак Blokus и другие упомянутые товарные знаки являются собственностью их соответствующих владельцев товарных знаков. Владельцы товарных знаков не связаны с автором программы Pentobi.

source: Game variant Classic
es: Variante de juego Clásico
ru: Вариант игры Классический

source: Game variant Duo
es: Variante de juego Dúo
ru: Вариант игры Двое

source: Game variant Trigon
es: Variante de juego Trigón
ru: Вариант игры Тригон

source: Game variant Nexos
es: Variante de juego Nexos
ru: Вариант игры Нексос

source: Game variant GembloQ
es: Variante de juego GembloQ
ru: Вариант игры ГемблоQ

source: Computer opponent for Blokus
es: Rival virtual para Blokus
ru: Оппонент компьютерной настольной игры Блокус

source: Blokus;Blokus Duo;Blokus Trigon;Blokus Junior;Nexos;Callisto;Gemblo Q;GembloQ
es: Blokus;Blokus Dúo;Blokus Trigón;Blokus Sencillo;Nexos;Calisto;Gemblo Q;GembloQ
ru: Блокус;Блокус Двое;Блокус Тригон;Блокус Юниор;Нексос;Каллисто;Гембло Q;ГемблоQ

source: Blokus game
es: Partida de Blokus
ru: Игра Блокус
